# coding : utf-8

# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"

name = input('Введите имя:')
age = int(input('Введите возраст:'))
city = input('Введите город:')

def n_a_c (name, age, city):
    print(name, age, 'год(а)', 'Проживает в городе', city)

n_a_c(name, age, city)


# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

x = int(input('Введите первое число:'))
y = int(input('Введите второе число:'))
z = int(input('Введите третье число:'))
def max_num(x, y, z):
    if y < x > z:
        print(x)
    elif x < y > z:
        print(y)
    elif y < z > x:
        print(z)

max_num(x, y, z)



# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов