# coding : utf-8

# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

fruit_list = ['Банан', 'Груша', 'Манго', 'Клубника']
for index, fruit in enumerate(fruit_list, start=1):
    print(index, fruit)
#Без этого действия^ выдает ошибку
print('')
print("1. {:>10}".format(fruit_list[0]))
print("2. {:>10}".format(fruit_list[1]))
print("3. {:>10}".format(fruit_list[2]))
print("4. {:>10}".format(fruit_list[3]))
# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

#Опять смутное чувство, что я делаю что-то не так, в задании указан именно список, а я испоользую множество
print('')
a = {111, 222, 333, 444}
b = {777, 222, 444, 555}
print(a - b)
print('')
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

list_int = [1, 5, 6, 87, 44, 20]
list2 = []
i = 0
while i > len(list_int):
    answer = list_int[i] / 2
    if answer is int:
        list2.append(answer / 2)
    else:
        list2.append(list_int[i] * 2)
    i += 1
print(list2)

#Старался как мог