# coding : utf-8

# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

list = [1, 2, 4, 0]
result = [ _ ** 2 for _ in list]
print(result)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

f_list1 = ['Маракуйя', 'Банан', 'Лимон', 'Ананас', 'Манго']
f_list2 = ['Апельсин', 'Маракуйя', 'Манго', 'Личи', 'Ананас']

mutual = [item for item in f_list1 if item in f_list2]
print(mutual)
# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4