# coding : utf-8

# Задача-1

color = input("Введите ваш любимый цвет:")
print("Вашим любимым цветом является:", color, "(Даже если это не цвет)")
level = int(input("Введите ваш уровеень:"))
print("Ваш уровень:", level)

# Задача-2

number = int(input("Введите число, к которому хотели бы прибавить 2:"))
print("В результате получаем:", number + 2)

# Задача-3

true_age = 18
age = int(input("Введите ваш возраст:"))
if age >= true_age:
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")
