# coding : utf-8

# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.

key = ['Антон', 'Леонид', 'Алексей', 'Елена']
val = [30000, 110000, 25000, 39000]
result = dict(zip(key, val))

def write_info(result):
    with open('salary.txt', 'w') as file:
        for key, val in result.items():
            file.write(f'{key}-{val}\n')

write_info(result)

#безуспешная попытка вычислиться остаток после вычитания 13%
for val in result:
    val = int(val * 0.87)

#не вижу смысла продолжать попытки решить это задание самостоятельно, т.к. я просто переписываю куски, которые нахожу
#то там, то здесь. Лично мне интуитивно совершенно непонятно как это делать
print(result)





