# coding : utf-8

# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

chislo = int(input('Введите положительное число'))
while chislo < 1:
    chislo = int(input('Введите положительное число'))
    if chislo > 9:
        chislo = int(input('Введите число меньше чем 10'))
else:
    if chislo < 10:
        print(chislo ** 2)
#3 часа попыток не дали результата. Не работает как надо

